[
  {
    "periode": "1920 - 1955",
    "sejarah": [
      {
        "judul": "Sejarah ISDV",
        "deskripsi": "ISDV adalah organisasi politik dengan ideologi komunis yang berdiri pada 9 Mei 1914. Organisasi ini berdiri di Surabaya oleh Henk Sneevliet. Sejarah ISDV bermula dari kedatangan Henk Sneevliet ke Hindia Belanda di tahun 1913 Dan Pada 23 Mei 1920, ISDV mulai mengubah namanya menjadi Perserikatan Komunis Hindia dan tanggal tersebut pun menjadi hari lahir PKI agar mampu menyesuaikan arus pergerakan global.",
        "tahun": 1925,
        "tokoh": ["Henk Sneevliet"],
        "image": "images/",
        "koordinat": [-7.257722911886063, 112.75497591724705]
      },
      {
        "judul": "Pertempuran Bandung Lautan Api",
        "deskripsi": "Salah satu pertempuran paling terkenal adalah Bandung Lautan Api yang dimulai ketika pasukan Sekutu diboncengi NICA tiba di Bandung pada 13 Oktober 1945. Mereka mengeluarkan ultimatum kepada para pejuang agar meninggalkan wilayah Bandung Utara, namun para pejuang menolak.Tentara Republik Indonesia (TRI) turun tangan dan bersedia mengosongkan Bandung. Namun sebelum meninggalkan Bandung, pada tanggal 23-24 Maret 1946, para pejuang menyerbu pos-pos Sekutu dan membumihanguskan kota Bandung menjadi seperti lautan api.",
        "tahun": 1946,
        "tokoh": [""],
        "image": "images/",
        "koordinat": [-6.9194612805111655, 107.62426932945388]
      },
      {
        "judul": "Peristiwa Merah Putih di Manado",
        "deskripsi": "Peristiwa Merah Putih di Manado merupakan peristiwa penyerbuan markas militer Belanda yang terjadi di Teling, Manado, 14 Februari 1946.  Pertempuran ini melibatkan himpunan rakyat di Sulawesi Utara, meliputi pasukan KNIL atau tentara Hindia Belanda dari kalangan pribumi, barisan pejuang, dan laskar rakyat. Peristiwa ini adalah bentuk perlawanan rakyat Sulawesi Utara demi mempertahankan kemerdekaannya serta menolak provokasi tentara Belanda.",
        "tahun": 1946,
        "tokoh": [""],
        "image": "images/",
        "koordinat": [1.474640425897046, 124.84187832237721]
      },
      {
        "judul": "Belanda Mengakui Kedaulatan RI",
        "deskripsi": "Belanda secara resmi mengakui kedaulatan Indonesia pada 27 Desember 1949. Pengakuan kedaulatan Indonesia dilakukan di Amsterdam dan Indonesia.Di Indonesia, pihak Indonesia diwakili Sri Sultan Hamengkubuwono IX dan Belanda diwakilkan oleh Wakil Tinggi Mahkota Belanda AHJ Lovink. Sementara di Belanda, pihak Indonesia diwakili Mohammad Hatta dan Belanda diwakili Ratu Juliana.",
        "tahun": 1949,
        "tokoh": [""],
        "image": "images/",
        "koordinat": [-6.170185163166136, 106.82424925587311]
      },
      {
        "judul": "Pertempuran Ambarawa",
        "deskripsi": "Pasukan Sekutu yang dipimpin Brigjen Bethel mendarat di Semarang pada 20 Oktober 1945. Saat Sekutu menuju Magelang, masyarakat menyerang mereka hingga terjadi kerusuhan.Di bawah kepemimpinan Kolonel Sudirman, pasukan TKR mengejar dan mengepung tentara Sekutu hingga terjadi pertempuran empat hari (12-15 Desember 1945) yang dikenal sebagai 'Palagan Ambarawa'.Pasukan TKR menang pada 15 Desember 1945. Tanggal tersebut diperingati sebagai Hari Juang Kartika TNI-AD.",
        "tahun": 1945,
        "tokoh": [""],
        "image": "images/",
        "koordinat": [-6.981445897124746, 110.41190989067313]
      },
      {
        "judul": "Serangan Umum 1 Maret",
        "deskripsi": "Salah satu peristiwa sejarah Indonesia pada masa AMB II adalah Serangan Umum 1 Maret 1949 di Yogyakarta. Pada 1 Maret 1949, gabungan tentara dan laskar Indonesia melakukan serangan umum di seluruh penjuru kota Yogyakarta di bawah komando Letkol Soeharto.Serangan ini berhasil membuat Belanda lumpuh dan pasukan Indonesia berhasil menduduki Yogyakarta selama sekitar 6 jam.",
        "tahun": 1949,
        "tokoh": ["rigjen Bethel"],
        "image": "images/",
        "koordinat": [-6.981445897124746, 110.41190989067313]
      },
      {
        "judul": "Insiden Hotel Yamato",
        "deskripsi": "Insiden Hotel Yamato adalah peristiwa perobekan warna biru pada bendera Belanda yang berkibar di Hotel Yamato (kini Hotel Majapahit) pada tanggal 19 September 1945 yang didahului oleh gagalnya perundingan antara Soedirman (residen Surabaya) dan Victor Willem Charles Ploegman untuk menurunkan bendera Belanda.",
        "tahun": 1945,
        "tokoh": [""],
        "image": "images/",
        "koordinat": [-7.259919153137783, 112.7397349423293]
      },
      {
        "judul": "Sejarah Himpunan Mahasiswa Islam",
        "deskripsi": "Sebelum lahirnya Himpunan Mahasiswa Islam, terlebih dulu berdiri organisasi kemahasiswaan bernama Perserikatan Mahasiswa Yogyakarta (PMY) pada tahun 1946 yang beranggotakan mahasiswa dari tiga Perguruan Tinggi di Yogyakarta, yaitu Sekolah Tinggi Teknik (STT), Sekolah Tinggi Islam (STI) dan Balai Perguruan Tinggi Gajah Mada yang pada waktu itu hanya memiliki Fakultas Hukum dan Fakultas Sastra. Oleh karena PMY dirasa tidak memperhatikan kepentingan para mahasiswa yang masih menjunjung tinggi nilai-nilai agama Islam. Tidak tersalurnya aspirasi keagamaan merupakan alasan kuat bagi para mahasiswa Islam untuk mendirikan organisasi kemahasiswaan yang berdiri dan terpisah dari PMY.",
        "tahun": 1947,
        "tokoh": [""],
        "image": "images/",
        "koordinat": [-7.8013317485312745, 110.36592022667463]
      },
      {
        "judul": "Kemerdekaan Indonesia",
        "deskripsi": "kemerdekaan Indonesia salah satunya adalah proklamasi yang terjadi pada tanggal 17 Agustus 1945 pukul 10.00 WIB di Jalan Pegangsaan Timur No. 56 Jakarta Pusat.Presiden Ke-1 RI Sukarno membacakan teks Proklamasi bersama Mohammad Hatta. Bendera Merah Putih dikibarkan. Informasi mengenai kemerdekaan Republik Indonesia kemudian menyebar ke seluruh pelosok negeri secara berangsur-angsur terutama menggunakan saluran radio.",
        "tahun": 1945,
        "tokoh": [""],
        "image": "images/",
        "koordinat": [-6.1989037345895825, 106.84272104986718]
      },
      {
        "judul": "Sejarah PNI",
        "deskripsi": "Partai Nasional Indonesia (PNI) adalah partai politik nasionalis di Indonesia yang didirikan pada tahun 1927. PNI didirikan oleh Presiden Pertama RI Soekarno sebelum kemerdekaan. Setelah kemerdekaan PNI baru memasok sejumlah perdana menteri, dan berpartisipasi dalam sebagian besar kabinet pada 1950-an dan 1960-an. Namun Partai ini dihancurkan dan dilebur secara paksa menjadi Partai Demokrasi Indonesia pada tahun 1973 oleh Presiden Kedua RI Soeharto.",
        "tahun": 1945,
        "tokoh": ["Soekarno"],
        "image": "images/",
        "koordinat": [-6.916790965860076, 107.61651392286628]
      }
    ]
  }
]
